// قائمة الكتب المدرسية الرسمية (الصفوف 4–10) — تُعرض داخل الموقع.
export type Textbook = { grade: string; subject: string; title: string; file: number };

export const textbooks: Textbook[] = [
 {
  "grade": "الصف الرابع",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 4514
 },
 {
  "grade": "الصف الرابع",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5749
 },
 {
  "grade": "الصف الرابع",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 5972
 },
 {
  "grade": "الصف الرابع",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 5971
 },
 {
  "grade": "الصف الرابع",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9142
 },
 {
  "grade": "الصف الرابع",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 9143
 },
 {
  "grade": "الصف الرابع",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9356
 },
 {
  "grade": "الصف الرابع",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 9357
 },
 {
  "grade": "الصف الرابع",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5671
 },
 {
  "grade": "الصف الرابع",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5672
 },
 {
  "grade": "الصف الرابع",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102891
 },
 {
  "grade": "الصف الرابع",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 102892
 },
 {
  "grade": "الصف الرابع",
  "subject": "العلوم",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 152
 },
 {
  "grade": "الصف الرابع",
  "subject": "العلوم",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 2236
 },
 {
  "grade": "الصف الرابع",
  "subject": "العلوم",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6017
 },
 {
  "grade": "الصف الرابع",
  "subject": "العلوم",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6022
 },
 {
  "grade": "الصف الرابع",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 4675
 },
 {
  "grade": "الصف الرابع",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 6534
 },
 {
  "grade": "الصف الرابع",
  "subject": "الدراسات الاجتماعية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9168
 },
 {
  "grade": "الصف الرابع",
  "subject": "الدراسات الاجتماعية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9351
 },
 {
  "grade": "الصف الرابع",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الأنشطة - الفصل الأول",
  "file": 31121
 },
 {
  "grade": "الصف الرابع",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5582
 },
 {
  "grade": "الصف الرابع",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5583
 },
 {
  "grade": "الصف الخامس",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 4519
 },
 {
  "grade": "الصف الخامس",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5648
 },
 {
  "grade": "الصف الخامس",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 5974
 },
 {
  "grade": "الصف الخامس",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 5973
 },
 {
  "grade": "الصف الخامس",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9677
 },
 {
  "grade": "الصف الخامس",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 9678
 },
 {
  "grade": "الصف الخامس",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9679
 },
 {
  "grade": "الصف الخامس",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 9680
 },
 {
  "grade": "الصف الخامس",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5673
 },
 {
  "grade": "الصف الخامس",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5674
 },
 {
  "grade": "الصف الخامس",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 10206
 },
 {
  "grade": "الصف الخامس",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 10207
 },
 {
  "grade": "الصف الخامس",
  "subject": "العلوم",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 1618
 },
 {
  "grade": "الصف الخامس",
  "subject": "العلوم",
  "title": "2 كتاب الأنشطة والتمارين - الفصل الأول",
  "file": 5653
 },
 {
  "grade": "الصف الخامس",
  "subject": "العلوم",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6016
 },
 {
  "grade": "الصف الخامس",
  "subject": "العلوم",
  "title": "4 كتاب الأنشطة والتمارين - الفصل الثاني",
  "file": 6021
 },
 {
  "grade": "الصف الخامس",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6911
 },
 {
  "grade": "الصف الخامس",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 7784
 },
 {
  "grade": "الصف الخامس",
  "subject": "الدراسات الاجتماعية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 10077
 },
 {
  "grade": "الصف الخامس",
  "subject": "الدراسات الاجتماعية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 10078
 },
 {
  "grade": "الصف الخامس",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الأنشطة - الفصل الأول",
  "file": 31123
 },
 {
  "grade": "الصف الخامس",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5586
 },
 {
  "grade": "الصف الخامس",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5587
 },
 {
  "grade": "الصف السادس",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6257
 },
 {
  "grade": "الصف السادس",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 6258
 },
 {
  "grade": "الصف السادس",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6516
 },
 {
  "grade": "الصف السادس",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 6517
 },
 {
  "grade": "الصف السادس",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5676
 },
 {
  "grade": "الصف السادس",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 1606
 },
 {
  "grade": "الصف السادس",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102885
 },
 {
  "grade": "الصف السادس",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 102886
 },
 {
  "grade": "الصف السادس",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6432
 },
 {
  "grade": "الصف السادس",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 6433
 },
 {
  "grade": "الصف السادس",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102824
 },
 {
  "grade": "الصف السادس",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 102825
 },
 {
  "grade": "الصف السادس",
  "subject": "العلوم",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5102
 },
 {
  "grade": "الصف السادس",
  "subject": "العلوم",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5101
 },
 {
  "grade": "الصف السادس",
  "subject": "العلوم",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6502
 },
 {
  "grade": "الصف السادس",
  "subject": "العلوم",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 6503
 },
 {
  "grade": "الصف السادس",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9189
 },
 {
  "grade": "الصف السادس",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9565
 },
 {
  "grade": "الصف السادس",
  "subject": "الدراسات الاجتماعية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 30116
 },
 {
  "grade": "الصف السادس",
  "subject": "الدراسات الاجتماعية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 30117
 },
 {
  "grade": "الصف السادس",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الأنشطة - الفصل الأول",
  "file": 31125
 },
 {
  "grade": "الصف السادس",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5588
 },
 {
  "grade": "الصف السادس",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5589
 },
 {
  "grade": "الصف السابع",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 3529
 },
 {
  "grade": "الصف السابع",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5748
 },
 {
  "grade": "الصف السابع",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 5970
 },
 {
  "grade": "الصف السابع",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 5969
 },
 {
  "grade": "الصف السابع",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9144
 },
 {
  "grade": "الصف السابع",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 9145
 },
 {
  "grade": "الصف السابع",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9354
 },
 {
  "grade": "الصف السابع",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 9355
 },
 {
  "grade": "الصف السابع",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5677
 },
 {
  "grade": "الصف السابع",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5678
 },
 {
  "grade": "الصف السابع",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 10204
 },
 {
  "grade": "الصف السابع",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 10205
 },
 {
  "grade": "الصف السابع",
  "subject": "العلوم",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5042
 },
 {
  "grade": "الصف السابع",
  "subject": "العلوم",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5121
 },
 {
  "grade": "الصف السابع",
  "subject": "العلوم",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6015
 },
 {
  "grade": "الصف السابع",
  "subject": "العلوم",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6020
 },
 {
  "grade": "الصف السابع",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 4509
 },
 {
  "grade": "الصف السابع",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 6533
 },
 {
  "grade": "الصف السابع",
  "subject": "الدراسات الاجتماعية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9167
 },
 {
  "grade": "الصف السابع",
  "subject": "الدراسات الاجتماعية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9563
 },
 {
  "grade": "الصف السابع",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 10125
 },
 {
  "grade": "الصف السابع",
  "subject": "المهارات الرقمية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 10218
 },
 {
  "grade": "الصف السابع",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5591
 },
 {
  "grade": "الصف السابع",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5592
 },
 {
  "grade": "الصف الثامن",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6255
 },
 {
  "grade": "الصف الثامن",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 6256
 },
 {
  "grade": "الصف الثامن",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6504
 },
 {
  "grade": "الصف الثامن",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 6505
 },
 {
  "grade": "الصف الثامن",
  "subject": "العلوم",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 1557
 },
 {
  "grade": "الصف الثامن",
  "subject": "العلوم",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 1558
 },
 {
  "grade": "الصف الثامن",
  "subject": "العلوم",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9594
 },
 {
  "grade": "الصف الثامن",
  "subject": "العلوم",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 7795
 },
 {
  "grade": "الصف الثامن",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9855
 },
 {
  "grade": "الصف الثامن",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 9856
 },
 {
  "grade": "الصف الثامن",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9857
 },
 {
  "grade": "الصف الثامن",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 9858
 },
 {
  "grade": "الصف الثامن",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5679
 },
 {
  "grade": "الصف الثامن",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5680
 },
 {
  "grade": "الصف الثامن",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102882
 },
 {
  "grade": "الصف الثامن",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 102883
 },
 {
  "grade": "الصف الثامن",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5049
 },
 {
  "grade": "الصف الثامن",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 6045
 },
 {
  "grade": "الصف الثامن",
  "subject": "الدراسات الاجتماعية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 10080
 },
 {
  "grade": "الصف الثامن",
  "subject": "الدراسات الاجتماعية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 10079
 },
 {
  "grade": "الصف الثامن",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 31106
 },
 {
  "grade": "الصف الثامن",
  "subject": "المهارات الرقمية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 103200
 },
 {
  "grade": "الصف الثامن",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5593
 },
 {
  "grade": "الصف الثامن",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5597
 },
 {
  "grade": "الصف التاسع",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 4710
 },
 {
  "grade": "الصف التاسع",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 2126
 },
 {
  "grade": "الصف التاسع",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 7772
 },
 {
  "grade": "الصف التاسع",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 7776
 },
 {
  "grade": "الصف التاسع",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5134
 },
 {
  "grade": "الصف التاسع",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5135
 },
 {
  "grade": "الصف التاسع",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102822
 },
 {
  "grade": "الصف التاسع",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 102823
 },
 {
  "grade": "الصف التاسع",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5681
 },
 {
  "grade": "الصف التاسع",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5684
 },
 {
  "grade": "الصف التاسع",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 10203
 },
 {
  "grade": "الصف التاسع",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 10211
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9185
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9566
 },
 {
  "grade": "الصف التاسع",
  "subject": "الكيمياء",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2135
 },
 {
  "grade": "الصف التاسع",
  "subject": "الكيمياء",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 6928
 },
 {
  "grade": "الصف التاسع",
  "subject": "الكيمياء",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 7770
 },
 {
  "grade": "الصف التاسع",
  "subject": "الكيمياء",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 7777
 },
 {
  "grade": "الصف التاسع",
  "subject": "الفيزياء",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6867
 },
 {
  "grade": "الصف التاسع",
  "subject": "الفيزياء",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 6868
 },
 {
  "grade": "الصف التاسع",
  "subject": "الفيزياء",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 7771
 },
 {
  "grade": "الصف التاسع",
  "subject": "الفيزياء",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 7778
 },
 {
  "grade": "الصف التاسع",
  "subject": "العلوم الحياتية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6930
 },
 {
  "grade": "الصف التاسع",
  "subject": "العلوم الحياتية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 6929
 },
 {
  "grade": "الصف التاسع",
  "subject": "العلوم الحياتية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9595
 },
 {
  "grade": "الصف التاسع",
  "subject": "العلوم الحياتية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 7779
 },
 {
  "grade": "الصف التاسع",
  "subject": "علوم الأرض والبيئة",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 1469
 },
 {
  "grade": "الصف التاسع",
  "subject": "علوم الأرض والبيئة",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 1470
 },
 {
  "grade": "الصف التاسع",
  "subject": "علوم الأرض والبيئة",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 7773
 },
 {
  "grade": "الصف التاسع",
  "subject": "علوم الأرض والبيئة",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 7780
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية الوطنية والمدنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5062
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية الوطنية والمدنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5086
 },
 {
  "grade": "الصف التاسع",
  "subject": "التاريخ",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2991
 },
 {
  "grade": "الصف التاسع",
  "subject": "التاريخ",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 3926
 },
 {
  "grade": "الصف التاسع",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 10124
 },
 {
  "grade": "الصف التاسع",
  "subject": "المهارات الرقمية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 10217
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5594
 },
 {
  "grade": "الصف التاسع",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 5598
 },
 {
  "grade": "الصف العاشر",
  "subject": "الرياضيات",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2103
 },
 {
  "grade": "الصف العاشر",
  "subject": "الرياضيات",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 5647
 },
 {
  "grade": "الصف العاشر",
  "subject": "الرياضيات",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 5967
 },
 {
  "grade": "الصف العاشر",
  "subject": "الرياضيات",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 5966
 },
 {
  "grade": "الصف العاشر",
  "subject": "العربية لغتي",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9146
 },
 {
  "grade": "الصف العاشر",
  "subject": "العربية لغتي",
  "title": "2 كتاب التمارين - الفصل الأول",
  "file": 9147
 },
 {
  "grade": "الصف العاشر",
  "subject": "العربية لغتي",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 9352
 },
 {
  "grade": "الصف العاشر",
  "subject": "العربية لغتي",
  "title": "4 كتاب التمارين - الفصل الثاني",
  "file": 9353
 },
 {
  "grade": "الصف العاشر",
  "subject": "اللغة الإنجليزية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 5682
 },
 {
  "grade": "الصف العاشر",
  "subject": "اللغة الإنجليزية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5685
 },
 {
  "grade": "الصف العاشر",
  "subject": "اللغة الإنجليزية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 102879
 },
 {
  "grade": "الصف العاشر",
  "subject": "اللغة الإنجليزية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 102880
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية الإسلامية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6333
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية الإسلامية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 6585
 },
 {
  "grade": "الصف العاشر",
  "subject": "الفيزياء",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2129
 },
 {
  "grade": "الصف العاشر",
  "subject": "الفيزياء",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5654
 },
 {
  "grade": "الصف العاشر",
  "subject": "الفيزياء",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6005
 },
 {
  "grade": "الصف العاشر",
  "subject": "الفيزياء",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6008
 },
 {
  "grade": "الصف العاشر",
  "subject": "الكيمياء",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 3689
 },
 {
  "grade": "الصف العاشر",
  "subject": "الكيمياء",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 3683
 },
 {
  "grade": "الصف العاشر",
  "subject": "الكيمياء",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6004
 },
 {
  "grade": "الصف العاشر",
  "subject": "الكيمياء",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6009
 },
 {
  "grade": "الصف العاشر",
  "subject": "العلوم الحياتية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 6760
 },
 {
  "grade": "الصف العاشر",
  "subject": "العلوم الحياتية",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 5655
 },
 {
  "grade": "الصف العاشر",
  "subject": "العلوم الحياتية",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6006
 },
 {
  "grade": "الصف العاشر",
  "subject": "العلوم الحياتية",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6010
 },
 {
  "grade": "الصف العاشر",
  "subject": "علوم الأرض والبيئة",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2134
 },
 {
  "grade": "الصف العاشر",
  "subject": "علوم الأرض والبيئة",
  "title": "2 كتاب الأنشطة - الفصل الأول",
  "file": 2105
 },
 {
  "grade": "الصف العاشر",
  "subject": "علوم الأرض والبيئة",
  "title": "3 كتاب الطالب - الفصل الثاني",
  "file": 6007
 },
 {
  "grade": "الصف العاشر",
  "subject": "علوم الأرض والبيئة",
  "title": "4 كتاب الأنشطة - الفصل الثاني",
  "file": 6011
 },
 {
  "grade": "الصف العاشر",
  "subject": "التاريخ",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9151
 },
 {
  "grade": "الصف العاشر",
  "subject": "التاريخ",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9567
 },
 {
  "grade": "الصف العاشر",
  "subject": "الجغرافيا",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9150
 },
 {
  "grade": "الصف العاشر",
  "subject": "الجغرافيا",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9562
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية الوطنية والمدنية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 9152
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية الوطنية والمدنية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 9568
 },
 {
  "grade": "الصف العاشر",
  "subject": "المهارات الرقمية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 31109
 },
 {
  "grade": "الصف العاشر",
  "subject": "المهارات الرقمية",
  "title": "2 كتاب الطالب - الفصل الثاني",
  "file": 103199
 },
 {
  "grade": "الصف العاشر",
  "subject": "الثقافة المالية",
  "title": "1 كتاب الطالب - الفصل الأول",
  "file": 2725
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية المهنية",
  "title": "1 كتاب الطالب - الجزء الأول",
  "file": 5595
 },
 {
  "grade": "الصف العاشر",
  "subject": "التربية المهنية",
  "title": "2 كتاب الطالب - الجزء الثاني",
  "file": 5599
 }
];

export const textbookIds = new Set(textbooks.map((b) => b.file));
